nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/eth/processor/eth_p32mx170f256d.h
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_ETH_FCSErrorCountGet(ETH_MODULE_ID index)
{
     return (uint16_t)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFCSErrorCount(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_AlignErrorCountClear(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_ETH_AlignErrorCountGet(ETH_MODULE_ID index)
{
     return (uint16_t)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsAlignmentErrorCount(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_MIIResetEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_MIIResetDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_MIIResetIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_SimResetEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_SimResetDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_SimResetIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_MCSRxResetEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_MCSRxResetDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_MCSRxResetIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFuncResetEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFuncResetDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_RxFuncResetIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_TxFuncResetIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMAC_Resets(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_LoopbackEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_LoopbackDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_LoopbackIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_TxPauseEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_TxPauseDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_TxPauseIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxPauseEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxPauseDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_RxPauseIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_PassAllEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_PassAllDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_PassAllIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_ReceiveEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_ReceiveDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_ReceiveIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_ExcessDeferEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_ExcessDeferDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_ExcessDeferIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_BackPresNoBackoffEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_BackPresNoBackoffDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_BackPresNoBackoffIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_NoBackoffEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_NoBackoffDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_NoBackoffIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_LongPreambleEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_LongPreambleDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_LongPreambleIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_PurePreambleEnable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_PurePreambleDisable(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_PurePreambleIsEnabled(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API ETH_AUTOPAD_OPTION _PLIB_UNSUPPORTED PLIB_ETH_AutoDetectPadGet(ETH_MODULE_ID index)
{
     return (ETH_AUTOPAD_OPTION)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_AutoDetectPadSet(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_AutoDetectPadClear(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_CRCEnable(ETH_MODULE_ID index)
{
     
